Revit 2027 API
BuiltInFailures.SketchFailures.BadRailingsProfile Property
 Rail profile must have one closed loop. Wrong profile will not be shown in profiles list for rail definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BadRailingsProfile { get; }
Public Shared ReadOnly Property BadRailingsProfile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BadRailingsProfile {
	FailureDefinitionId^ get ();
}
static member BadRailingsProfile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace